src/InformationRegisters/ВЧ_ОчередьУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВЧ_ОчередьУведомлений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Значение по умолчанию: "Ожидает"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВЧ_СтатусыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПопыткиОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Значение по умолчанию: "НовыйСотрудник"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Доп. данные (ФИО, телефон и т.д.)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Когда задача поставлена в очередь</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйКадровик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИДСообщения</Name>
					<Comment>Ключ уникальности (GUID)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDКанала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВЧ_СтатусыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВЧ_СтатусыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ВЧ_ОбработчикиСобытий/Module.bsl
//###############################################################################
// Обработчики событий для интеграции с VoceChat
//###############################################################################

#Область ОбработкаОчереди

// Обрабатывает очередь уведомлений для отправки в VoceChat
//
&НаСервере
Процедура Обработать() Экспорт
	
	МаксПопыток = ПолучитьМаксимальноеКоличествоПопыток();
	ОчередьСообщений = ПолучитьОчередьСообщений(МаксПопыток);
	
	ОбработатьОчередьСообщений(ОчередьСообщений);
	
КонецПроцедуры

// Возвращает максимальное количество попыток отправки уведомления
//
// Возвращаемое значение:
//   Число - максимальное количество попыток
//
&НаСервере
Функция ПолучитьМаксимальноеКоличествоПопыток()
	
	МаксПопыток = Константы.ВЧ_МаксимальноеКоличествоПопыток.Получить();
	Возврат Макс(МаксПопыток, 1);
	
КонецФункции

// Получает очередь сообщений ожидающих отправки
//
// Параметры:
//   МаксПопыток - Число - максимальное количество попыток отправки
//
// Возвращаемое значение:
//   ТаблицаЗначений - очередь сообщений
//
&НаСервере
Функция ПолучитьОчередьСообщений(Знач МаксПопыток)
	
	Запрос = СоздатьЗапросОчередиСообщений();
	Запрос.УстановитьПараметр("СтатусОжидает", Перечисления.ВЧ_СтатусыУведомлений.Ожидает);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("МаксПопыток", МаксПопыток);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Создает запрос для получения очереди сообщений
//
// Возвращаемое значение:
//   Запрос - сформированный запрос
//
&НаСервере
Функция СоздатьЗапросОчередиСообщений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|	ВЫБРАТЬ
		|	Очередь.ИДСообщения КАК ИДСообщения,
		|	Очередь.Период КАК Период,
		|	Очередь.ДокументОснование КАК ДокументОснование,
		|	Очередь.ТекстСообщения КАК ТекстСообщения,
		|	Очередь.IDКанала КАК IDКанала,
		|	Очередь.ПопыткиОтправки КАК ПопыткиОтправки
		|ИЗ
		|	РегистрСведений.ВЧ_ОчередьУведомлений.СрезПоследних(
		|			&ТекущаяДата,
		|			Статус = &СтатусОжидает
		|				И ПопыткиОтправки < &МаксПопыток) КАК Очередь
		|
		|УПОРЯДОЧИТЬ ПО
        |	Очередь.Период ВОЗР";
	
	Возврат Запрос;
	
КонецФункции

// Обрабатывает очередь сообщений
//
// Параметры:
//   ОчередьСообщений - ТаблицаЗначений - очередь сообщений для обработки
//
&НаСервере
Процедура ОбработатьОчередьСообщений(Знач ОчередьСообщений)
	
	Для Каждого ЭлементОчереди Из ОчередьСообщений Цикл
		ОбработатьЭлементОчереди(ЭлементОчереди);
	КонецЦикла;
	
КонецПроцедуры

// Обрабатывает элемент очереди уведомлений
//
// Параметры:
//   Элемент - СтрокаТаблицыЗначений - элемент очереди уведомлений
//
&НаСервере
Процедура ОбработатьЭлементОчереди(Знач Элемент)
	
	Попытка
		Результат = ОтправитьУведомление(Элемент);
		ОбновитьСтатусЗадачи(Элемент.ИДСообщения, Элемент.Период, Результат);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписатьОшибкуВЖурнал("Ошибка отправки уведомления: " + ТекстОшибки, Элемент.ДокументОснование);
		ОбновитьСтатусЗадачи(Элемент.ИДСообщения, Элемент.Период, СоздатьРезультатОшибки(ТекстОшибки));
	КонецПопытки;
	
КонецПроцедуры

// Отправляет уведомление в VoceChat
//
// Параметры:
//   Элемент - СтрокаТаблицыЗначений - элемент очереди уведомлений
//
// Возвращаемое значение:
//   Структура - результат отправки
//
&НаСервере
Функция ОтправитьУведомление(Знач Элемент)
	
	ТекстСообщения = ПолучитьТекстСообщенияИзХранилища(Элемент.ТекстСообщения);
	
	Возврат ВЧ_ИнтеграцияСервер.ОтправитьУведомление(Элемент.IDКанала, ТекстСообщения);
	
КонецФункции

// Получает текст сообщения из хранилища значений
//
// Параметры:
//   ХранилищеТекста - ХранилищеЗначения - хранилище текста сообщения
//
// Возвращаемое значение:
//   Строка - текст сообщения
//
&НаСервере
Функция ПолучитьТекстСообщенияИзХранилища(Знач ХранилищеТекста)
	
	ЗначениеИзХранилища = ХранилищеТекста.Получить();
	
	Если ТипЗнч(ЗначениеИзХранилища) <> Тип("Строка") Тогда
		ВызватьИсключение("Неверный тип данных в хранилище: " + ТипЗнч(ЗначениеИзХранилища));
	КонецЕсли;
	
	Возврат ЗначениеИзХранилища;
	
КонецФункции

#КонецОбласти

#Область ФормированиеСообщения

// Формирует текст уведомления для отправки в VoceChat
//
// Параметры:
//   Данные - Структура - данные сотрудника
//   ФИОКадровика - Строка - ФИО ответственного кадровика
//
// Возвращаемое значение:
//   Строка - текст уведомления
//
&НаСервере
Функция СформироватьТекстУведомления(Знач Данные, Знач ФИОКадровика)
	
	ПараметрыСообщения = СоздатьПараметрыСообщения(Данные, ФИОКадровика);
	
	Возврат СтрШаблон(ШаблонСообщения(),
		ПараметрыСообщения.ФИО,
		ПараметрыСообщения.Должность,
		ПараметрыСообщения.Подразделение,
		ПараметрыСообщения.Телефон,
		ПараметрыСообщения.ФИОКадровика,
		ПараметрыСообщения.ДатаВремя);
		
КонецФункции

// Возвращает шаблон сообщения для уведомления
//
// Примечание:
//  На данном этапе разработки шаблон сообщения жестко задан в коде.
//  В будущем планируется вынесение шаблона в константы или настройки для возможности изменения без переписывания кода.
//
// Возвращаемое значение:
//   Строка - шаблон сообщения
//
&НаСервере
Функция ШаблонСообщения()
	
	Возврат " *Новая задача!*
	|═══════════════════════
	|Принят новый сотрудник.
	|
	| *ФИО:* %1
	| *Должность:* %2
	| *Подразделение:* %3
	| *Контакт с новым сотрудником (тел.):* %4
	|
	|═══════════════════════
	| *Задача:* Необходимо создать корпоративную электронную почту.
	|
	| *Ответственный кадровик:* %5
	|⏰ *Дата время:* %6
	|═══════════════════════
	|_Уведомление из 1С:ЗУП 3.1_";
	
КонецФункции

// Создает структуру параметров для сообщения
//
// Параметры:
//   Данные - Структура - данные сотрудника
//   ФИОКадровика - Строка - ФИО ответственного кадровика
//
// Возвращаемое значение:
//   Структура - параметры сообщения
//
&НаСервере
Функция СоздатьПараметрыСообщения(Знач Данные, Знач ФИОКадровика)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ФИО", ПолучитьЗначениеИлиПоУмолчанию(Данные.ФИО, "Не определено"));
	Параметры.Вставить("Должность", ПолучитьЗначениеИлиПоУмолчанию(Данные.Должность, "Не указана"));
	Параметры.Вставить("Подразделение", ПолучитьЗначениеИлиПоУмолчанию(Данные.Подразделение, "Не указано"));
	Параметры.Вставить("Телефон", ПолучитьЗначениеИлиПоУмолчанию(Данные.Телефон, "Не указан"));
	Параметры.Вставить("ФИОКадровика", ПолучитьЗначениеИлиПоУмолчанию(ФИОКадровика, "Не определён"));
	Параметры.Вставить("ДатаВремя", ТекущаяДатаСеанса());
	
	Возврат Параметры;
	
КонецФункции

// Возвращает значение или значение по умолчанию
//
// Параметры:
//   Значение - Произвольный - проверяемое значение
//   ЗначениеПоУмолчанию - Произвольный - значение, возвращаемое если значение не заполнено
//
// Возвращаемое значение:
//   Произвольный - значение или значение по умолчанию
//
&НаСервере
Функция ПолучитьЗначениеИлиПоУмолчанию(Знач Значение, Знач ЗначениеПоУмолчанию)
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат Значение;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПередЗаписью документа ПриемНаРаботу
//
// Параметры:
//   Источник - ДокументОбъект - документ-источник
//   Отказ - Булево - флаг отказа от записи
//   РежимЗаписи - РежимЗаписиДокумента - режим записи документа
//   РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
&НаСервере
Процедура ВЧ_ПриПриемеНаРаботуПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ДолженСоздаватьУведомление(Источник, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСотрудника = ПолучитьДанныеСотрудника(Источник.Сотрудник, Источник);
	
	Если ДанныеСотрудника = Неопределено Тогда
		ЗаписатьОшибкуВЖурнал("Не удалось получить данные сотрудника");
		Возврат;
	КонецЕсли;
	
	ДанныеСотрудника.Вставить("ФИОКадровика", Источник.Ответственный);
	СоздатьУведомлениеВСистеме(Источник, ДанныеСотрудника);
	
КонецПроцедуры

// Проверяет необходимость создания уведомления
//
// Параметры:
//   Источник - ДокументОбъект - документ-источник
//   РежимЗаписи - РежимЗаписиДокумента - режим записи документа
//
// Возвращаемое значение:
//   Булево - Истина, если необходимо создать уведомление
//
&НаСервере
Функция ДолженСоздаватьУведомление(Знач Источник, Знач РежимЗаписи)
	
	Возврат ЭтоПервоеПроведение(РежимЗаписи, Источник.Проведен)
		И ИспользоватьИнтеграцию()
		И Источник.Сотрудник <> Неопределено;
	
КонецФункции

// Проверяет использование интеграции с VoceChat
//
// Возвращаемое значение:
//   Булево - Истина, если интеграция используется
//
&НаСервере
Функция ИспользоватьИнтеграцию()
	Возврат Константы.ВЧ_ИспользоватьИнтеграцию.Получить();
КонецФункции

// Создает уведомление в системе VoceChat
//
// Параметры:
//   Источник - ДокументОбъект - документ-основание
//   ДанныеСотрудника - Структура - данные сотрудника для уведомления
//
&НаСервере
Процедура СоздатьУведомлениеВСистеме(Знач Источник, Знач ДанныеСотрудника)
	
	IDКанала = Константы.ВЧ_IDКанала.Получить();
	
	Если НЕ ЗначениеЗаполнено(IDКанала) Тогда
		ЗаписатьПредупреждениеВЖурнал("Не настроен канал для отправки уведомлений");
		Возврат;
	КонецЕсли;
	
	Попытка
		ТекстСообщения = СформироватьТекстУведомления(ДанныеСотрудника, Строка(ДанныеСотрудника.ФИОКадровика));

		ДобавитьВОчередьУведомлений(
			Источник.Ссылка,                 
			ТекстСообщения,                  
			IDКанала,                        
			ДанныеСотрудника.ФИОКадровика,
			Источник.Сотрудник
		);
		
		ЗаписатьИнформациюВЖурнал("Задача поставлена в очередь. Сотрудник: " + ДанныеСотрудника.ФИО, Источник.Ссылка);
	Исключение
		ЗаписатьОшибкуВЖурнал("Ошибка записи в регистр: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСЖурналомРегистрации

// Возвращает имя события журнала регистрации для интеграции
//
// Возвращаемое значение:
//   Строка - имя события журнала регистрации
//
&НаСервере
Функция ИмяСобытияЖурналаРегистрации()
	Возврат "ВЧ_Интеграция";
КонецФункции

// Записывает информационное сообщение в журнал регистрации
//
// Параметры:
//   Сообщение - Строка - текст сообщения
//   ДанныеСобытия - Произвольный - данные события
//
&НаСервере
Процедура ЗаписатьИнформациюВЖурнал(Знач Сообщение, Знач ДанныеСобытия = Неопределено)
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация, , ДанныеСобытия, Сообщение);
КонецПроцедуры

// Записывает предупреждение в журнал регистрации
//
// Параметры:
//   Сообщение - Строка - текст сообщения
//   ДанныеСобытия - Произвольный - данные события
//
&НаСервере
Процедура ЗаписатьПредупреждениеВЖурнал(Знач Сообщение, Знач ДанныеСобытия = Неопределено)
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение, , ДанныеСобытия, Сообщение);
КонецПроцедуры

// Записывает ошибку в журнал регистрации
//
// Параметры:
//   Сообщение - Строка - текст сообщения
//   ДанныеСобытия - Произвольный - данные события
//
&НаСервере
Процедура ЗаписатьОшибкуВЖурнал(Знач Сообщение, Знач ДанныеСобытия = Неопределено)
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка, , ДанныеСобытия, Сообщение);
КонецПроцедуры

#КонецОбласти

#Область РаботаССтатусамиЗадачи

// Создает структуру результата успешной операции
//
// Возвращаемое значение:
//   Структура - результат операции с признаком успеха
//
&НаСервере
Функция СоздатьРезультатУспеха()
	Возврат Новый Структура("Успех, Детали", Истина, "");
КонецФункции

// Создает структуру результата операции с ошибкой
//
// Параметры:
//   ОписаниеОшибки - Строка - описание ошибки
//
// Возвращаемое значение:
//   Структура - результат операции с признаком ошибки и деталями
//
&НаСервере
Функция СоздатьРезультатОшибки(Знач ОписаниеОшибки)
	Возврат Новый Структура("Успех, Детали", Ложь, ОписаниеОшибки);
КонецФункции

// Обновляет статус задачи в очереди уведомлений
//
// Параметры:
//   ИДСообщения - Строка - идентификатор сообщения
//   Период - Дата - период записи
//   Результат - Структура - результат операции отправки
//
&НаСервере
Процедура ОбновитьСтатусЗадачи(Знач ИДСообщения, Знач Период, Знач Результат)
	
	НаборЗаписей = СоздатьНаборЗаписейПоОтборам(ИДСообщения, Период);
	
	Если НаборЗаписей.Количество() = 0 Тогда
		ЗаписатьОшибкуВЖурнал("ЗАПИСЬ НЕ НАЙДЕНА по ИДСообщения=" + ИДСообщения + ", Период=" + Период);
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей[0];
	ОбновитьПоляЗаписи(Запись, Результат);
	НаборЗаписей.Записать(Истина);
	
	ЗаписатьИнформациюВЖурнал("Статус обновлён на " + ?(Результат.Успех, "ОТПРАВЛЕНО", "ОШИБКА") + ". Попыток: " + Запись.ПопыткиОтправки);
	
КонецПроцедуры

// Создает набор записей регистра по отборам
//
// Параметры:
//   ИДСообщения - Строка - идентификатор сообщения
//   Период - Дата - период записи
//
// Возвращаемое значение:
//   НаборЗаписейРегистраСведений - набор записей регистра
//
&НаСервере
Функция СоздатьНаборЗаписейПоОтборам(Знач ИДСообщения, Знач Период)
	
	НаборЗаписей = РегистрыСведений.ВЧ_ОчередьУведомлений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИДСообщения.Установить(ИДСообщения);
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей;
	
КонецФункции

// Обновляет поля записи в регистре
//
// Параметры:
//   Запись - РегистрСведенийЗапись - запись регистра
//   Результат - Структура - результат операции отправки
//
&НаСервере
Процедура ОбновитьПоляЗаписи(Запись, Знач Результат)
	
	Запись.ПопыткиОтправки = Запись.ПопыткиОтправки + 1;
	Запись.ДатаПоследнейПопытки = ТекущаяДатаСеанса();
	Запись.Статус = ОпределитьСтатусПоРезультату(Результат.Успех);
	Запись.ТекстОшибки = ?(Результат.Успех, "", Результат.Детали);
	
КонецПроцедуры

// Определяет статус на основе успешности операции
//
// Параметры:
//   Успех - Булево - признак успешности операции
//
// Возвращаемое значение:
//   Перечисление - статус уведомления
//
&НаСервере
Функция ОпределитьСтатусПоРезультату(Знач Успех)
	
	Возврат ?(Успех, 
		Перечисления.ВЧ_СтатусыУведомлений.Отправлено,
		Перечисления.ВЧ_СтатусыУведомлений.Ошибка);
	
КонецФункции

#КонецОбласти

#Область РаботаСОчередьюУведомлений

// Добавляет уведомление в очередь на отправку
//
// Параметры:
//   ДокументОснование - ДокументСсылка - документ-основание
//   ТекстСообщения - Строка - текст уведомления
//   IDКанала - Строка - идентификатор канала в VoceChat
//   ОтветственныйКадровик - СправочникСсылка - ФИО ответственного кадровика
//   Сотрудник - СправочникСсылка - сотрудник
//
&НаСервере
Процедура ДобавитьВОчередьУведомлений(
	Знач ДокументОснование,
	Знач ТекстСообщения,
	Знач IDКанала,
	Знач ОтветственныйКадровик,
	Знач Сотрудник
)
	
	ИДСообщения = Строка(Новый УникальныйИдентификатор());
	ТекущийПериод = ТекущаяДатаСеанса();
	
	ЗаписатьИнформациюВЖурнал(
		"Добавление в очередь: Документ=" + ТипЗнч(ДокументОснование) + ", ТекстДлиной=" + СтрДлина(ТекстСообщения)
	);
	
	НаборЗаписей = СоздатьИЗаполнитьНаборЗаписей(
		ИДСообщения,
		ТекущийПериод,
		ТекстСообщения,
		IDКанала,
		ОтветственныйКадровик,
		ДокументОснование,
		Сотрудник
	);
	
	НаборЗаписей.Записать(Истина);
	ЗаписатьИнформациюВЖурнал("Запись в регистр выполнена. ИДСообщения=" + ИДСообщения);
	
КонецПроцедуры

// Создает и заполняет набор записей регистра
//
// Параметры:
//   ИДСообщения - Строка - идентификатор сообщения
//   ТекущийПериод - Дата - период записи
//   ТекстСообщения - Строка - текст уведомления
//   IDКанала - Строка - идентификатор канала в VoceChat
//   ОтветственныйКадровик - СправочникСсылка - ФИО ответственного кадровика
//   ДокументОснование - ДокументСсылка - документ-основание
//   Сотрудник - СправочникСсылка - сотрудник
//
// Возвращаемое значение:
//   НаборЗаписейРегистраСведений - заполненный набор записей
//
&НаСервере
Функция СоздатьИЗаполнитьНаборЗаписей(
	Знач ИДСообщения,
	Знач ТекущийПериод,
	Знач ТекстСообщения,
	Знач IDКанала,
	Знач ОтветственныйКадровик,
	Знач ДокументОснование,
	Знач Сотрудник
)
	
	НаборЗаписей = РегистрыСведений.ВЧ_ОчередьУведомлений.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	
	ЗаполнитьРеквизитыЗаписи(
		Запись,
		ИДСообщения,
		ТекущийПериод,
		ТекстСообщения,
		IDКанала,
		ОтветственныйКадровик,
		ДокументОснование,
		Сотрудник
	);
	
	НаборЗаписей.Отбор.Период.Установить(ТекущийПериод);
	НаборЗаписей.Отбор.ИДСообщения.Установить(ИДСообщения);
	
	Возврат НаборЗаписей;
	
КонецФункции

// Заполняет реквизиты записи очереди уведомлений
//
// Параметры:
//   Запись - РегистрСведенийЗапись - запись регистра
//   ИДСообщения - Строка - идентификатор сообщения
//   ТекущийПериод - Дата - период записи
//   ТекстСообщения - Строка - текст уведомления
//   IDКанала - Строка - идентификатор канала в VoceChat
//   ОтветственныйКадровик - СправочникСсылка - ФИО ответственного кадровика
//   ДокументОснование - ДокументСсылка - документ-основание
//   Сотрудник - СправочникСсылка - сотрудник
//
&НаСервере
Процедура ЗаполнитьРеквизитыЗаписи(
	Знач Запись,
	Знач ИДСообщения,
	Знач ТекущийПериод,
	Знач ТекстСообщения,
	Знач IDКанала,
	Знач ОтветственныйКадровик,
	Знач ДокументОснование,
	Знач Сотрудник
)
	
	Запись.Период = ТекущийПериод;
	Запись.ИДСообщения = ИДСообщения;
	Запись.Статус = Перечисления.ВЧ_СтатусыУведомлений.Ожидает;
	Запись.ТекстСообщения = Новый ХранилищеЗначения(ТекстСообщения);
	Запись.ПопыткиОтправки = 0;
	Запись.ТипСобытия = "НовыйСотрудник"; 
	Запись.ТекстОшибки = "";
	Запись.ДатаСоздания = ТекущийПериод;
	Запись.ДатаПоследнейПопытки = Дата(1, 1, 1);
	Запись.ОтветственныйКадровик = ОтветственныйКадровик;
	Запись.ДокументОснование = ДокументОснование;
	Запись.Сотрудник = Сотрудник;
	Запись.IDКанала = IDКанала;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанныхСотрудника

// Получает данные сотрудника для формирования уведомления
//
// Параметры:
//   СсылкаНаСотрудника - СправочникСсылка.Сотрудники - ссылка на сотрудника
//   ИсточникДокумент - ДокументОбъект - документ-источник
//
// Возвращаемое значение:
//   Структура - данные сотрудника или Неопределено
//
&НаСервере
Функция ПолучитьДанныеСотрудника(СсылкаНаСотрудника, ИсточникДокумент = Неопределено)
	
	Данные = СоздатьПустуюСтруктуруДанных();
	ЗаполнитьКадровыеДанные(Данные, СсылкаНаСотрудника, ИсточникДокумент);
	
	Если ПустаяСтрока(Данные.ФИО) Тогда
		ЗаполнитьДанныеИзДокумента(Данные, СсылкаНаСотрудника, ИсточникДокумент);
	КонецЕсли;
	
	ЗаполнитьКонтактнуюИнформацию(Данные, СсылкаНаСотрудника);
	
	Если ПустаяСтрока(Данные.ФИО) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

// Создает пустую структуру данных сотрудника
//
// Возвращаемое значение:
//   Структура - пустая структура данных сотрудника
//
&НаСервере
Функция СоздатьПустуюСтруктуруДанных()
	
	Данные = Новый Структура;
	Данные.Вставить("ФИО", "");
	Данные.Вставить("Должность", "");
	Данные.Вставить("Подразделение", "");
	Данные.Вставить("Телефон", "");
	Данные.Вставить("Email", "");
	Данные.Вставить("ФИОКадровика", "");
	
	Возврат Данные;
	
КонецФункции

// Заполняет кадровые данные сотрудника
//
// Параметры:
//   Данные - Структура - структура для заполнения
//   СсылкаНаСотрудника - СправочникСсылка.Сотрудники - ссылка на сотрудника
//   ИсточникДокумент - ДокументОбъект - документ-источник
//
&НаСервере
Процедура ЗаполнитьКадровыеДанные(Данные, СсылкаНаСотрудника, ИсточникДокумент)
	
	Попытка
		ТЗКадровые = КадровыйУчет.КадровыеДанныеСотрудников(
			Истина,
			СсылкаНаСотрудника,
			"ФИОПолные, Должность, Подразделение",
			ТекущаяДатаСеанса()
		);
		
		Если ТЗКадровые.Количество() > 0 Тогда
			СтрокаДанных = ТЗКадровые[0];
			Данные.ФИО = СтрокаДанных.ФИОПолные;
			
			Если ИсточникДокумент <> Неопределено Тогда
				Данные.Должность = ПолучитьНаименованиеИлиПусто(ИсточникДокумент.Должность);
				Данные.Подразделение = ПолучитьНаименованиеИлиПусто(ИсточникДокумент.Подразделение);
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Ошибка при получении кадровых данных сотрудника ожидаема
	КонецПопытки;
	
КонецПроцедуры

// Заполняет данные сотрудника из документа
//
// Параметры:
//   Данные - Структура - структура для заполнения
//   СсылкаНаСотрудника - СправочникСсылка.Сотрудники - ссылка на сотрудника
//   ИсточникДокумент - ДокументОбъект - документ-источник
//
&НаСервере
Процедура ЗаполнитьДанныеИзДокумента(Данные, СсылкаНаСотрудника, ИсточникДокумент)
	
	Попытка
		Если СсылкаНаСотрудника <> Неопределено И СсылкаНаСотрудника.ФизическоеЛицо <> Неопределено Тогда 
			Данные.ФИО = СсылкаНаСотрудника.ФизическоеЛицо.Наименование;
		КонецЕсли;
	Исключение
		ЗаписатьПредупреждениеВЖурнал("Ошибка при получении ФИО из справочника сотрудников: " + ОписаниеОшибки(), СсылкаНаСотрудника);
	КонецПопытки;
	
	Если ИсточникДокумент <> Неопределено Тогда
		Данные.Должность = ПолучитьНаименованиеИлиПусто(ИсточникДокумент.Должность);
		Данные.Подразделение = ПолучитьНаименованиеИлиПусто(ИсточникДокумент.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет контактную информацию сотрудника
//
// Параметры:
//   Данные - Структура - структура для заполнения
//   СсылкаНаСотрудника - СправочникСсылка.Сотрудники - ссылка на сотрудника
//
&НаСервере
Процедура ЗаполнитьКонтактнуюИнформацию(Данные, СсылкаНаСотрудника)
	
	Попытка
		Если СсылкаНаСотрудника <> Неопределено И СсылкаНаСотрудника.ФизическоеЛицо <> Неопределено Тогда 
			ФизЛицо = СсылкаНаСотрудника.ФизическоеЛицо;
			Данные.Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ФизЛицо,
				Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица, 
				ТекущаяДатаСеанса(),
				Истина);
		КонецЕсли;
	Исключение
		ЗаписатьПредупреждениеВЖурнал("Ошибка при получении контактной информации: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Возвращает наименование ссылки или пустую строку
//
// Параметры:
//   Ссылка - СправочникСсылка - ссылка на объект
//
// Возвращаемое значение:
//   Строка - наименование или пустая строка
//
&НаСервере
Функция ПолучитьНаименованиеИлиПусто(Знач Ссылка)
	
	Если Ссылка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		Возврат Ссылка.Наименование;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

// Проверяет, является ли это первым проведением документа
//
// Параметры:
//   РежимЗаписи - РежимЗаписиДокумента - режим записи документа
//   ДокументПроведен - Булево - признак проведенности документа
//
// Возвращаемое значение:
//   Булево - Истина, если первое проведение
//
&НаСервере
Функция ЭтоПервоеПроведение(Знач РежимЗаписи, Знач ДокументПроведен)
	Возврат РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ДокументПроведен;
КонецФункции

#КонецОбласти

#КонецОбласти
